[
    {
        "name": "+2",
        "description": "The standard time penalty in WCA competitions, plus two seconds."
    },
    {
        "name": "2GLL",
        "description": "2-Generator Last Layer. These algorithms are used for the ZBLL cases which require only edge permutation and corner orientation."
    },
    {
        "name": "2LLL",
        "description": "2 Look Last Layer - solving the last layer in two steps or 'looks'. For the CFOP method, this generally refers to OLL and PLL."
    },
    {
        "name": "3x3",
        "description": "The common term for this puzzle. A 3x3 refers to any Rubik's Cube type puzzle with the dimensions 3x3x3 produced by a company other than Rubik's."
    },
    {
        "name": "Algorithm",
        "description": "An algorithm is a sequence of moves designed to achieve a particular outcome on a puzzle."
    },
    {
        "name": "Anti-Sune",
        "description": "The inverse of the Sune algorithm, the Anti-Sune algorithm re-orients 3 corners anticlockwise."
    },
    {
        "name": "Ao5, Ao12, ...",
        "description": "most of the bragging rights within the community go to the best averages solvers can achieve. An Average of 5 (Ao5) is calculated using any five consecutive solves."
    },
    {
        "name": "AUF",
        "description": "Adjusting \"U\" Face"
    },
    {
        "name": "Bandaged cube",
        "description": "Puzzles which restrict the ways you can turn them by having the mechanism designed to get in the way and be annoying."
    },
    {
        "name": "Beginner's method",
        "description": "A beginner's method refers to speedsolving methods designed for beginners, which often have many steps to simplify the process."
    },
    {
        "name": "BLD",
        "description": "Blindfolded speedcubing - refers to solving cubes blindfolded."
    },
    {
        "name": "BLE",
        "description": "Brooks' Last Edge. These algorithms insert an edge into your your last F2L slot and orient the corners of the last layer."
    },
    {
        "name": "Blockbuilding",
        "description": "Blockbuilding generally refers to inuitively solving blocks of pieces around the cube, in contrast to algorithmic speedcubing approaches."
    },
    {
        "name": "Center",
        "description": "Refers to the middle piece on each side of a Rubik's cube. For bigger cubes, it refers to the pieces with only one colour."
    },
    {
        "name": "Centre piece",
        "description": "A centre piece is a piece, or pieces resp., in the middle of a cube."
    },
    {
        "name": "CFOP",
        "description": "The most common speedsolving method, which solves the cube in the following sequence: Cross-F2L-OLL-PLL"
    },
    {
        "name": "CLL",
        "description": "Corners of Last Layer. These algorithms solve the corners of the last layer, as their name suggests."
    },
    {
        "name": "CLS",
        "description": "Corner Last Slot. CLS algorithms solve the last F2L corner and orient your last layer at the same time. They are used when the edge of your final F2L pair is already solved, and the last layer edges are oriented."
    },
    {
        "name": "COLL",
        "description": "Corners and Orientation of Last Layer. COLL algorithms are used to orient and permute the corners of your last layer at the same time."
    },
    {
        "name": "Colour Neutrality",
        "description": "The solver is able to create the cross on any colour, and therefore has 6 different options for cross to pick from"
    },
    {
        "name": "Colour scheme",
        "description": "The color layout of the cube."
    },
    {
        "name": "Commutator",
        "description": "A sequence of moves of the form A-B-A'-B'. Example: (R' D' R) (U) (R' D R) (U')\n\n"
    },
    {
        "name": "Conjugate",
        "description": "A  sequence of moves of the form A-B-A'. Example: (R U2 R') (R' F R F') (R U2 R')"
    },
    {
        "name": "Core",
        "description": "The center point of the entire puzzle which all pieces revolve around. It never participates in the solving process. It's purely there for functionality to hold the puzzle together."
    },
    {
        "name": "Corner",
        "description": "Refers to the corner pieces on the Rubik's cube, which are the pieces with three different colours."
    },
    {
        "name": "Corner Cutting",
        "description": "Speed cube pieces have the ability to move slightly without the whole puzzle falling apart. This ability is called corner cutting."
    },
    {
        "name": "Corner piece",
        "description": "Corner pieces, as the name suggests, are located at the corners of the cube."
    },
    {
        "name": "Corner turning",
        "description": "uzzles which have their centers on the corner and everything rotates around the corner like a Skewb."
    },
    {
        "name": "Corner Twists",
        "description": "Sometimes corners can twist in their place. A puzzle cannot be solved when a single corner twists in it's place"
    },
    {
        "name": "CP",
        "description": "Corner Permutation"
    },
    {
        "name": "Cross",
        "description": "The cross generally refers to correctly solving 4 edge pieces around a center piece, to form a 'plus' or 'cross' out of the center and edge stickers."
    },
    {
        "name": "Cube",
        "description": "The term cube is often used in place of Twisty Puzzle even if the puzzle isn't cube shaped."
    },
    {
        "name": "Cube notation",
        "description": "The language we use to read and write algorithms."
    },
    {
        "name": "Cube Rotation",
        "description": "Rotating the cube in place without turning any of the sides. The three rotational axes used in cube notation are x y and z."
    },
    {
        "name": "Cubelet",
        "description": "A single cube piece is sometimes called a cubelet or cubie."
    },
    {
        "name": "Cubing",
        "description": "The action of solving TwistyPuzzles."
    },
    {
        "name": "Cuboid",
        "description": " face turning puzzles where at least one of the dimensions is different from the others like a 3x3x5 or a 2x4x6."
    },
    {
        "name": "Devil's number",
        "description": "The term devil's number refers to the number of moves required to solve a cube from any starting configuration using a single repeating algorithm. Devil's algorithm is the algorithm needed to achieve this task. To this day, neither man nor machine were able to calculate the devil's algorithm, or the devil’s number, for the 2x2 cube or the other larger models. These calculations result in an unimaginably large number of possibilities that, so far, could not be captured."
    },
    {
        "name": "DNF",
        "description": "Did not finish. You get this penalty when you don't finish the cube inspection in 15 seconds or the cube is not in solved position when you stop the timer."
    },
    {
        "name": "DNS",
        "description": "Did Not Start"
    },
    {
        "name": "Edge",
        "description": "Refers to the edge pieces on the Rubik's cube, which have two different colours."
    },
    {
        "name": "Edge Control",
        "description": "Intentionally orienting last layer edges whilst solving the first two layers."
    },
    {
        "name": "Edge piece",
        "description": "Edge pieces are the outer pieces located between the corner pieces of a cube. A 3x3 cube, therefore, has one piece per side between the corner pieces, a 4x4 cube two pieces per side."
    },
    {
        "name": "ELL",
        "description": "Edges of Last Layer"
    },
    {
        "name": "End by end by end",
        "description": "Face turning puzzles with the same dimensions on all sides like a 3x3x3, 7x7x7 or 21x21x21."
    },
    {
        "name": "EO",
        "description": "Edge Orientation"
    },
    {
        "name": "EP",
        "description": "Edge Permutation"
    },
    {
        "name": "Extended Cross",
        "description": "Solving the cross and one F2L pair at the same time, also referred to as 'X-Cross'"
    },
    {
        "name": "F2L",
        "description": "First 2 Layers. This step involves inserting “pairs” of corners and edges into the spaces around the four edges dependent on the centres"
    },
    {
        "name": "Face",
        "description": "A single surface of a Rubik's cube."
    },
    {
        "name": "Fewest moves",
        "description": "Fewest moves means you solve a speed cube in as few moves as possible."
    },
    {
        "name": "Fingertricks",
        "description": "Flick your fingers to turn a side rather than using your whole hand."
    },
    {
        "name": "Florian Mod",
        "description": "Cubes that are said to have a florian mod have curved corners to help the pieces to move more easily around each other."
    },
    {
        "name": "FMC",
        "description": "Fewest Moves Challenge"
    },
    {
        "name": "Fridrich Method",
        "description": "Also known as CFOP, the most common speedsolving method, which solves the cube in the following sequence: Cross-F2L-OLL-PLL"
    },
    {
        "name": "Gear puzzle",
        "description": "A series of puzzles which have gears as a component of the pieces. As you turn the puzzle the gears spin."
    },
    {
        "name": "Global average",
        "description": "Overall average time it takes to solve a twisty puzzle."
    },
    {
        "name": "God's number",
        "description": "God's number, also called \"God's algorithm\", is the minimum number of moves needed to solve a cube, regardless of the starting configuration."
    },
    {
        "name": "Half-Turn",
        "description": "Any 180 degree turn of the Rubik's cube."
    },
    {
        "name": "Inspection",
        "description": "The time used to inspect the cube before starting a solve. In WCA competitions, the maximum inspection time is 15 seconds."
    },
    {
        "name": "Internal edges",
        "description": "Pieces usually found on even layered cubes."
    },
    {
        "name": "Layer",
        "description": "Refers to all of the pieces which make up one rotational side of a Rubik's cube.\n\n"
    },
    {
        "name": "LBL",
        "description": "Layer By Layer"
    },
    {
        "name": "LL",
        "description": "Last layer"
    },
    {
        "name": "Lock-up \/ locking",
        "description": "Lock-up or locking are terms used to describe when the cube jams. When a piece, one or even multiple layers are misaligned, you won’t be able to execute the turn correctly and the cube locks up. "
    },
    {
        "name": "Look-Ahead",
        "description": "Planning future stages of a speedsolve whilst executing moves to solve the pieces of the current stage."
    },
    {
        "name": "MagLev",
        "description": "MagLev is short for magnetic levitation or magnetic levitation force, respectively. Cubes with MagLev construction have in their tensioning system two superimposed magnets whose like poles face, and thus repel, each other."
    },
    {
        "name": "Magnetic Cube",
        "description": "Cube with magnets on the pieces which attract each other, allowing the cube to snap into alignment and less likely to lock up from misalignment."
    },
    {
        "name": "MBLD",
        "description": "Multi-blindfolded speedcubing - refers to solving cubes blindfolded."
    },
    {
        "name": "Mechanism",
        "description": "The components of a twisty puzzle that allow it to fit together and actually work."
    },
    {
        "name": "Mod",
        "description": "Any kind of modification done to a puzzle."
    },
    {
        "name": "Move Count",
        "description": "The number of moves used in a Rubik's cube solve."
    },
    {
        "name": "Multislotting",
        "description": "Intentionally inserting F2L pairs in a manner which influences subsequent F2L pairs in your favour."
    },
    {
        "name": "Niklas",
        "description": "The algorithm R U' L' U R' U' L, which re-orients 3 corners clockwise."
    },
    {
        "name": "OH",
        "description": "One-Handed speedcubing - refers to solving cubes with one hand."
    },
    {
        "name": "OLL",
        "description": "Orientation of Last Layer"
    },
    {
        "name": "OLLCP",
        "description": "Orientation of Last Layer + Corner Permutation"
    },
    {
        "name": "Overshooting",
        "description": "Overshooting describes a rotation that goes further than desired. For example, you intend to rotate a layer by 90 degrees, but due to high speed, it overshoots and turns 180 degrees instead."
    },
    {
        "name": "Parity",
        "description": "Parity in a speedsolving context generally refers to additional steps required to solve a puzzle in cases where there are (or appear to be) an odd number of piece swaps on a cube."
    },
    {
        "name": "Pattern",
        "description": "Describes specific permutations in which a puzzle looks really cool, like the checkerboard pattern or the cube in a cube pattern"
    },
    {
        "name": "PB",
        "description": "If a speedcuber solves a puzzle faster than they have ever done before, it is known as a PB or personal best. "
    },
    {
        "name": "PBL",
        "description": "Permutation of Both Layers, a step used in some common 2x2 methods which permute the top and bottom layer corners."
    },
    {
        "name": "Permutation",
        "description": "Describes the position a puzzle is currently in."
    },
    {
        "name": "Petrus Method",
        "description": "A 3x3 speedsolving method developed by Lars Petrus which has a strong emphasis on blockbuilding."
    },
    {
        "name": "PLL",
        "description": "Permutation of Last Layer"
    },
    {
        "name": "Popping",
        "description": "Since the pieces of a cube can move around it is possible for them to pop out completely. It can be caused by loose tensions, rough turning, or be result of the mechanism that is used in a specific puzzle."
    },
    {
        "name": "Quarter Turn",
        "description": "Any 90 degree turn of the Rubik's cube."
    },
    {
        "name": "Reduction",
        "description": "A common big cube solving method whereby the cuber solves the center pieces into place, followed by pairing up edge pieces to effectively 'reduce' the big cube to a 3x3."
    },
    {
        "name": "Roux",
        "description": "A 3x3 speedsolving method developed by Gilles Roux in which 1x2x3 blocks are built on the left and right sides of the cube to begin the solve."
    },
    {
        "name": "Rubik's Cube",
        "description": "a puzzle in the form of a plastic cube covered with multicoloured squares, which the player attempts to twist and turn so that all the squares on each face are of the same colour."
    },
    {
        "name": "Scramble",
        "description": "A scramble is another simple term that consists of 20 randomly generated moves in standard notation that will leave the cube in an unsolved state ready for a solver to attempt"
    },
    {
        "name": "Sculpted design",
        "description": "The term 'sculpted design' describes puzzles with a special surface."
    },
    {
        "name": "Sexy Move",
        "description": "Refers to the move sequence R U R' U'"
    },
    {
        "name": "Shape mod",
        "description": "A puzzle which uses the same mechanism as a simple puzzle like a 3x3 but different shaped pieces to add complexities like shape shifting."
    },
    {
        "name": "Shape shifting",
        "description": "Puzzles that change shape as you scramble them. "
    },
    {
        "name": "Side",
        "description": "A single surface of a Rubik's cube."
    },
    {
        "name": "Sledgehammer",
        "description": "Refers to the move sequence R' F R F'"
    },
    {
        "name": "Slice Move",
        "description": "On a 3x3, a slice move refers to the notated moves M, E, and S."
    },
    {
        "name": "Smart Cube",
        "description": "Usually a 3x3 with the capability to connect to apps or a computer which allows a program to track your moves, start and stop timers, keep a log of what turns you did when you solved."
    },
    {
        "name": "Solve",
        "description": "Solved describes the permutation in which the puzzle is done. Almost all twisty puzzles have only one solved permutation."
    },
    {
        "name": "Speed mod",
        "description": "Modification of a puzzle not to change the solving process but to make the puzzle turn better."
    },
    {
        "name": "Speedcube",
        "description": "Twisty puzzles that are designed for speed and are suitable to be used in competitions."
    },
    {
        "name": "Speedcubing",
        "description": "The action of solving TwistyPuzzles as fast as possible"
    },
    {
        "name": "Stack mat",
        "description": "A timer which requires both hands to be placed on either side of it for it to start and stop."
    },
    {
        "name": "Sticker mod",
        "description": "When the stickers on a puzzle are changed to something different like a shepherd cube where the stickers are arrows and you need to get all the arrows pointing the same way on all sides."
    },
    {
        "name": "Stickered",
        "description": "Stickered cubes usually have a monochrome (often black) interior and coloured stickers"
    },
    {
        "name": "Stickerless",
        "description": "Stickerless cubes are made of coloured plastic pieces. This has the advantage that there are no stickers to be replaced."
    },
    {
        "name": "Sub-X",
        "description": "A single solve or average that is under a certain time"
    },
    {
        "name": "Sune",
        "description": "The algorithm R U R' U R U2 R'"
    },
    {
        "name": "Super cube",
        "description": "Puzzles which require the center pieces to be rotated correctly for the puzzle to be solved."
    },
    {
        "name": "Tension",
        "description": "Refers to the tightness or looseness of a screw in the mechanism."
    },
    {
        "name": "Torpedos",
        "description": "Little pieces of plastic that are on the internal part of an edge piece which connect with the corner piece to provide stability."
    },
    {
        "name": "TPS",
        "description": "Turns Per Second"
    },
    {
        "name": "Twisty Puzzle",
        "description": "The politically correct term for Rubik's Cube type puzzle. Any three dimensional puzzle with moving parts and the goal of achieving a solved state like the same color on each side counts as a Twisty Puzzle."
    },
    {
        "name": "Two look OLL \/ PLL",
        "description": "Complete the OLL \/ PLL steps with two algorithms each"
    },
    {
        "name": "UWR",
        "description": "Turns Per Second"
    },
    {
        "name": "VLS",
        "description": "Valk Last Slot. VLS algorithms solve the final F2L slot and OLL at the same time, in the cases where you have a connected F2L pair."
    },
    {
        "name": "WCA",
        "description": "World Cube Association"
    },
    {
        "name": "WR",
        "description": "World Record"
    },
    {
        "name": "WV",
        "description": "Winter Variation. These algorithms are used to orient the corners of your last layer whilst you insert your final F2L pair, in the case where the pair is connected."
    },
    {
        "name": "Yau",
        "description": "A big cube speedsolving method proposed by Robert Yau, whereby the cross is solved before the cube is fully reduced to the 3x3 stage."
    },
    {
        "name": "ZBF2L",
        "description": "Zborowski-Bruchem First 2 Layers. These algorithms solve the final F2L pair and orient the edges of the last layer to set up for ZBLL."
    },
    {
        "name": "ZBLL",
        "description": "Zborowski-Bruchem Last Layer. These algorithms solve the entire last layer in 1 step, when the last layer edges are oriented."
    },
    {
        "name": "ZZ",
        "description": "A 3x3 speedsolving method created by Zbiginiew Zborowski in which the first step involves orienting all edges on the cube."
    }
]